      *>FD          : CSBHF004.CPY
       SELECT CSBHD004 Assign to disk wid-csbh004
              organization    is indexed
              access mode     is dynamic
              record key      is feisd-chave-1
              alternate key   is feisd-chave-2 with duplicates
              alternate key   is feisd-chave-3 with duplicates
              lock mode       is manual
              file status     is ws-resultado-acesso.
