      *>FD          : CSBHF006.CPY
       SELECT CSBHD006 Assign to disk wid-csbh006
              organization    is indexed
              access mode     is dynamic
              record key      is fdfnc-chave-1
              lock mode       is manual
              file status     is ws-resultado-acesso.
