      *>FD          : CSBHF008.CPY
       SELECT CSBHD008 Assign to disk wid-csbh008
              organization    is indexed
              access mode     is dynamic
              record key      is fddps-chave-1
              lock mode       is manual
              file status     is ws-resultado-acesso.
