
      *>FD          : BSCHF001.CPY
       SELECT CSBHD001 Assign to disk wid-csbh001
              organization    is indexed
              access mode     is dynamic
              record key      is fclj-chave-1
              alternate key   is fclj-chave-2 with duplicates
              lock mode       is manual
              file status     is ws-resultado-acesso.
