      *>FD          : CSBHF009.CPY
       SELECT CSBHD009 Assign to disk wid-csbh009
              organization    is indexed
              access mode     is dynamic
              record key      is fdpdt-produto
              lock mode       is manual
              file status     is ws-resultado-acesso.
