      *>FD          : CSBHF002.CPY
       SELECT CSBHD002 Assign to disk wid-csbh002
              lock mode       is manual
              file status     is ws-resultado-acesso
              organization is indexed
              access mode is dynamic
              record key      is fccdd-chave-1.
