      *>FD          : CSBHF003.CPY
       SELECT CSBHD003 Assign to disk wid-csbh003
              organization    is indexed
              access mode     is dynamic
              record key      is fesd-chave-1
              alternate key   is fesd-chave-2 with duplicates
              lock mode       is manual
              file status     is ws-resultado-acesso.
