

      *>FD          : BSCHF999.CPY
       SELECT CSBHD999 Assign to disk wid-CSBH999
              status  is ws-resultado-acesso
              organization is line sequential.
