      *>FD          : CSBHF005.CPY
       SELECT CSBHD005 Assign to disk wid-csbh005
              organization    is indexed
              access mode     is dynamic
              record key      is fetpt-chave-1
              lock mode       is manual
              file status     is ws-resultado-acesso.
